Ran Plan for 6 projects:

1. dir: `infra/us-east-1/mgmt/atlantis/ecr` workspace: `default`
1. dir: `infra/us-east-1/mgmt/atlantis/key-pair` workspace: `default`
1. dir: `infra/us-east-1/mgmt/atlantis/acm` workspace: `default`
1. dir: `infra/us-east-1/mgmt/atlantis/ec2` workspace: `default`
1. dir: `infra/us-east-1/mgmt/atlantis/alb` workspace: `default`
1. dir: `infra/us-east-1/mgmt/atlantis/security-group` workspace: `default`

### 1. dir: `infra/us-east-1/mgmt/atlantis/ecr` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2024-01-17T18:22:35Z level=warning msg=No double-slash (//) found in source URL /terraform-aws-modules/terraform-aws-ecr.git. Relative paths in downloaded Terraform code may not work.

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/aws versions matching ">= 4.22.0"...
- Installing hashicorp/aws v5.32.1...
- Installed hashicorp/aws v5.32.1 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!
data.aws_partition.current: Reading...
data.aws_caller_identity.current: Reading...
data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_caller_identity.current: Read complete after 0s [id=677160962006]
data.aws_iam_policy_document.repository[0]: Reading...
data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=3792795651]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.this[0] will be created
+   resource "aws_ecr_lifecycle_policy" "this" {
+       id          = (known after apply)
+       policy      = jsonencode(
            {
+               rules = [
+                   {
+                       action       = {
+                           type = "expire"
                        }
+                       description  = "keep last 20 images"
+                       rulePriority = 10
+                       selection    = {
+                           countNumber = 20
+                           countType   = "imageCountMoreThan"
+                           tagStatus   = "any"
                        }
                    },
+                   {
+                       action       = {
+                           type = "expire"
                        }
+                       description  = "Expire untagged images older than 14 days"
+                       rulePriority = 1
+                       selection    = {
+                           countNumber = 1
+                           countType   = "sinceImagePushed"
+                           countUnit   = "days"
+                           tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
+       registry_id = (known after apply)
+       repository  = "scde"
    }

  # aws_ecr_repository.this[0] will be created
+   resource "aws_ecr_repository" "this" {
+       arn                  = (known after apply)
+       id                   = (known after apply)
+       image_tag_mutability = "IMMUTABLE"
+       name                 = "scde"
+       registry_id          = (known after apply)
+       repository_url       = (known after apply)
+       tags_all             = {
+           "Environment"  = "mgmt"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }

+       encryption_configuration {
+           encryption_type = "AES256"
+           kms_key         = (known after apply)
        }

+       image_scanning_configuration {
+           scan_on_push = true
        }
    }

  # aws_ecr_repository_policy.this[0] will be created
+   resource "aws_ecr_repository_policy" "this" {
+       id          = (known after apply)
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = [
+                           "ecr:ListTagsForResource",
+                           "ecr:ListImages",
+                           "ecr:GetRepositoryPolicy",
+                           "ecr:GetLifecyclePolicyPreview",
+                           "ecr:GetLifecyclePolicy",
+                           "ecr:GetDownloadUrlForLayer",
+                           "ecr:GetAuthorizationToken",
+                           "ecr:DescribeRepositories",
+                           "ecr:DescribeImages",
+                           "ecr:DescribeImageScanFindings",
+                           "ecr:BatchGetImage",
+                           "ecr:BatchCheckLayerAvailability",
                        ]
+                       Effect    = "Allow"
+                       Principal = {
+                           AWS = "arn:aws:iam::677160962006:root"
                        }
+                       Sid       = "PrivateReadOnly"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       registry_id = (known after apply)
+       repository  = "scde"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   repository_arn         = (known after apply)
+   repository_registry_id = (known after apply)
+   repository_url         = (known after apply)
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/mgmt/atlantis/ecr`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fmgmt%252Fatlantis%252Fecr%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/mgmt/atlantis/ecr`
</details>
Plan: 3 to add, 0 to change, 0 to destroy.

---
### 2. dir: `infra/us-east-1/mgmt/atlantis/key-pair` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/mgmt/atlantis/key-pair`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fmgmt%252Fatlantis%252Fkey-pair%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/mgmt/atlantis/key-pair`

---
### 3. dir: `infra/us-east-1/mgmt/atlantis/acm` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2024-01-17T18:22:36Z level=warning msg=No double-slash (//) found in source URL /terraform-aws-modules/terraform-aws-acm.git. Relative paths in downloaded Terraform code may not work.

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/aws versions matching ">= 4.40.0"...
- Installing hashicorp/aws v5.32.1...
- Installed hashicorp/aws v5.32.1 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_acm_certificate.this[0] will be created
+   resource "aws_acm_certificate" "this" {
+       arn                       = (known after apply)
+       domain_name               = "atlantis-ec2.scdev.aws.iohkdev.io"
+       domain_validation_options = [
+           {
+               domain_name           = "atlantis-ec2.scdev.aws.iohkdev.io"
+               resource_record_name  = (known after apply)
+               resource_record_type  = (known after apply)
+               resource_record_value = (known after apply)
            },
        ]
+       id                        = (known after apply)
+       key_algorithm             = (known after apply)
+       not_after                 = (known after apply)
+       not_before                = (known after apply)
+       pending_renewal           = (known after apply)
+       renewal_eligibility       = (known after apply)
+       renewal_summary           = (known after apply)
+       status                    = (known after apply)
+       subject_alternative_names = [
+           "atlantis-ec2.scdev.aws.iohkdev.io",
        ]
+       tags                      = {
+           "Environment" = "mgmt"
+           "Name"        = "atlantis-acm"
+           "Project"     = "scde"
+           "Tribe"       = "smartcontracts"
        }
+       tags_all                  = {
+           "Environment"  = "mgmt"
+           "Name"         = "atlantis-acm"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       type                      = (known after apply)
+       validation_emails         = (known after apply)
+       validation_method         = "DNS"

+       options {
+           certificate_transparency_logging_preference = "ENABLED"
        }
    }

  # aws_acm_certificate_validation.this[0] will be created
+   resource "aws_acm_certificate_validation" "this" {
+       certificate_arn         = (known after apply)
+       id                      = (known after apply)
+       validation_record_fqdns = (known after apply)

+       timeouts {}
    }

  # aws_route53_record.validation[0] will be created
+   resource "aws_route53_record" "validation" {
+       allow_overwrite = true
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = (known after apply)
+       records         = (known after apply)
+       ttl             = 60
+       type            = (known after apply)
+       zone_id         = "Z10147571DRRDCJXSER5Y"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   acm_certificate_arn                       = (known after apply)
+   acm_certificate_domain_validation_options = [
+       {
+           domain_name           = "atlantis-ec2.scdev.aws.iohkdev.io"
+           resource_record_name  = (known after apply)
+           resource_record_type  = (known after apply)
+           resource_record_value = (known after apply)
        },
    ]
+   acm_certificate_status                    = (known after apply)
+   acm_certificate_validation_emails         = (known after apply)
+   distinct_domain_names                     = [
+       "atlantis-ec2.scdev.aws.iohkdev.io",
    ]
+   validation_domains                        = (known after apply)
+   validation_route53_record_fqdns           = [
+       (known after apply),
    ]
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/mgmt/atlantis/acm`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fmgmt%252Fatlantis%252Facm%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/mgmt/atlantis/acm`
</details>
Plan: 3 to add, 0 to change, 0 to destroy.

---
### 4. dir: `infra/us-east-1/mgmt/atlantis/ec2` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2024-01-17T18:22:36Z level=warning msg=No double-slash (//) found in source URL /terraform-aws-modules/terraform-aws-vpc.git. Relative paths in downloaded Terraform code may not work. prefix=[/atlantis-data/repos/input-output-hk/sc-dev-platform/121/default/infra/us-east-1/mgmt/vpc] 
time=2024-01-17T18:23:55Z level=warning msg=No double-slash (//) found in source URL /terraform-aws-modules/terraform-aws-ec2-instance.git. Relative paths in downloaded Terraform code may not work.

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/aws versions matching ">= 4.66.0"...
- Installing hashicorp/aws v5.32.1...
- Installed hashicorp/aws v5.32.1 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!
data.aws_partition.current: Reading...
data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_iam_policy_document.assume_role_policy[0]: Reading...
data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=1256122602]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_instance_profile.this[0] will be created
+   resource "aws_iam_instance_profile" "this" {
+       arn         = (known after apply)
+       create_date = (known after apply)
+       id          = (known after apply)
+       name        = (known after apply)
+       name_prefix = "atlantis-"
+       path        = "/"
+       role        = (known after apply)
+       tags        = {
+           "Name" = "atlantis"
        }
+       tags_all    = {
+           "Environment"  = "mgmt"
+           "Name"         = "atlantis"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       unique_id   = (known after apply)
    }

  # aws_iam_role.this[0] will be created
+   resource "aws_iam_role" "this" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ec2.amazonaws.com"
                        }
+                       Sid       = "EC2AssumeRole"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       description           = "IAM role for EC2 instance"
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = "atlantis-"
+       path                  = "/"
+       tags                  = {
+           "Name" = "atlantis"
        }
+       tags_all              = {
+           "Environment"  = "mgmt"
+           "Name"         = "atlantis"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.this["AdministratorAccess"] will be created
+   resource "aws_iam_role_policy_attachment" "this" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
+       role       = (known after apply)
    }

  # aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"] will be created
+   resource "aws_iam_role_policy_attachment" "this" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
+       role       = (known after apply)
    }

  # aws_instance.this[0] will be created
+   resource "aws_instance" "this" {
+       ami                                  = "ami-02aead0a55359d6ec"
+       arn                                  = (known after apply)
+       associate_public_ip_address          = (known after apply)
+       availability_zone                    = (known after apply)
+       cpu_core_count                       = (known after apply)
+       cpu_threads_per_core                 = (known after apply)
+       disable_api_stop                     = (known after apply)
+       disable_api_termination              = (known after apply)
+       ebs_optimized                        = (known after apply)
+       get_password_data                    = false
+       host_id                              = (known after apply)
+       host_resource_group_arn              = (known after apply)
+       iam_instance_profile                 = (known after apply)
+       id                                   = (known after apply)
+       instance_initiated_shutdown_behavior = (known after apply)
+       instance_lifecycle                   = (known after apply)
+       instance_state                       = (known after apply)
+       instance_type                        = "t2.micro"
+       ipv6_address_count                   = (known after apply)
+       ipv6_addresses                       = (known after apply)
+       key_name                             = "scde-atlantis-kp"
+       monitoring                           = (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
+       placement_partition_number           = (known after apply)
+       primary_network_interface_id         = (known after apply)
+       private_dns                          = (known after apply)
+       private_ip                           = (known after apply)
+       public_dns                           = (known after apply)
+       public_ip                            = (known after apply)
+       secondary_private_ips                = (known after apply)
+       security_groups                      = (known after apply)
+       source_dest_check                    = true
+       spot_instance_request_id             = (known after apply)
+       subnet_id                            = "subnet-06b0cea9c49f5b5aa"
+       tags                                 = {
+           "Name" = "atlantis"
        }
+       tags_all                             = {
+           "Environment"  = "mgmt"
+           "Name"         = "atlantis"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       tenancy                              = (known after apply)
+       user_data                            = "d4d90ba07b36ea4c92c1db0593c1a4f78ab1907c"
+       user_data_base64                     = (known after apply)
+       user_data_replace_on_change          = false
+       volume_tags                          = {
+           "Name" = "atlantis"
        }
+       vpc_security_group_ids               = [
+           "sg-0e60b9696d130d49e",
        ]

+       credit_specification {}

+       enclave_options {
+           enabled = (known after apply)
        }

+       metadata_options {
+           http_endpoint               = "enabled"
+           http_protocol_ipv6          = "disabled"
+           http_put_response_hop_limit = 1
+           http_tokens                 = "optional"
+           instance_metadata_tags      = (known after apply)
        }

+       timeouts {}
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   ami                                = "ami-02aead0a55359d6ec"
+   arn                                = (known after apply)
+   availability_zone                  = (known after apply)
+   capacity_reservation_specification = (known after apply)
+   ebs_block_device                   = (known after apply)
+   ephemeral_block_device             = (known after apply)
+   iam_instance_profile_arn           = (known after apply)
+   iam_instance_profile_id            = (known after apply)
+   iam_instance_profile_unique        = (known after apply)
+   iam_role_arn                       = (known after apply)
+   iam_role_name                      = (known after apply)
+   iam_role_unique_id                 = (known after apply)
+   id                                 = (known after apply)
+   instance_state                     = (known after apply)
+   ipv6_addresses                     = (known after apply)
+   outpost_arn                        = (known after apply)
+   password_data                      = (known after apply)
+   primary_network_interface_id       = (known after apply)
+   private_dns                        = (known after apply)
+   private_ip                         = (known after apply)
+   public_dns                         = (known after apply)
+   public_ip                          = (known after apply)
+   root_block_device                  = (known after apply)
+   tags_all                           = {
+       Environment  = "mgmt"
+       Name         = "atlantis"
+       Organization = "iog"
+       Project      = "scde"
+       Terraform    = "true"
+       Tribe        = "smartcontracts"
    }
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/mgmt/atlantis/ec2`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fmgmt%252Fatlantis%252Fec2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/mgmt/atlantis/ec2`
</details>
Plan: 5 to add, 0 to change, 0 to destroy.

---
### 5. dir: `infra/us-east-1/mgmt/atlantis/alb` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_lb.this[0] will be created
+   resource "aws_lb" "this" {
+       arn                                                          = (known after apply)
+       arn_suffix                                                   = (known after apply)
+       desync_mitigation_mode                                       = "defensive"
+       dns_name                                                     = (known after apply)
+       drop_invalid_header_fields                                   = true
+       enable_deletion_protection                                   = true
+       enable_http2                                                 = true
+       enable_tls_version_and_cipher_suite_headers                  = false
+       enable_waf_fail_open                                         = false
+       enable_xff_client_port                                       = false
+       enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
+       id                                                           = (known after apply)
+       idle_timeout                                                 = 60
+       internal                                                     = (known after apply)
+       ip_address_type                                              = (known after apply)
+       load_balancer_type                                           = "application"
+       name                                                         = "atlantis-mgmt-smartcontracts-alb"
+       name_prefix                                                  = (known after apply)
+       preserve_host_header                                         = false
+       security_groups                                              = (known after apply)
+       subnets                                                      = [
+           "subnet-06b0cea9c49f5b5aa",
+           "subnet-07b8a937d49c2a72a",
        ]
+       tags                                                         = {
+           "terraform-aws-modules" = "alb"
        }
+       tags_all                                                     = {
+           "Environment"           = "mgmt"
+           "Organization"          = "iog"
+           "Project"               = "scde"
+           "Terraform"             = "true"
+           "Tribe"                 = "smartcontracts"
+           "terraform-aws-modules" = "alb"
        }
+       vpc_id                                                       = (known after apply)
+       xff_header_processing_mode                                   = "append"
+       zone_id                                                      = (known after apply)

+       timeouts {}
    }

  # aws_security_group.this[0] must be replaced
+/- resource "aws_security_group" "this" {
!       arn                    = "arn:aws:ec2:us-east-1:677160962006:security-group/sg-0a44fadcad8aa09fb" -> (known after apply)
!       description            = "Security group for atlantis application load balancer" -> "Security group for atlantis-mgmt-smartcontracts-alb application load balancer" # forces replacement
!       egress                 = [
-           {
-               cidr_blocks      = [
-                   "10.100.0.0/16",
                ]
-               description      = ""
-               from_port        = 0
-               ipv6_cidr_blocks = []
-               prefix_list_ids  = []
-               protocol         = "-1"
-               security_groups  = []
-               self             = false
-               to_port          = 0
            },
        ] -> (known after apply)
!       id                     = "sg-0a44fadcad8aa09fb" -> (known after apply)
!       ingress                = [
-           {
-               cidr_blocks      = [
-                   "0.0.0.0/0",
                ]
-               description      = "HTTP web traffic"
-               from_port        = 80
-               ipv6_cidr_blocks = []
-               prefix_list_ids  = []
-               protocol         = "tcp"
-               security_groups  = []
-               self             = false
-               to_port          = 82
            },
-           {
-               cidr_blocks      = [
-                   "0.0.0.0/0",
                ]
-               description      = "HTTPS web traffic"
-               from_port        = 443
-               ipv6_cidr_blocks = []
-               prefix_list_ids  = []
-               protocol         = "tcp"
-               security_groups  = []
-               self             = false
-               to_port          = 445
            },
        ] -> (known after apply)
!       name                   = "atlantis-20240117175357014400000001" -> (known after apply)
!       name_prefix            = "atlantis-" -> "atlantis-mgmt-smartcontracts-alb-" # forces replacement
!       owner_id               = "677160962006" -> (known after apply)
        tags                   = {
            "terraform-aws-modules" = "alb"
        }
        # (3 unchanged attributes hidden)
    }

  # aws_vpc_security_group_egress_rule.this["all"] must be replaced
-/+ resource "aws_vpc_security_group_egress_rule" "this" {
!       arn                    = "arn:aws:ec2:us-east-1:677160962006:security-group-rule/sgr-0350132db55c09df4" -> (known after apply)
!       id                     = "sgr-0350132db55c09df4" -> (known after apply)
!       security_group_id      = "sg-0a44fadcad8aa09fb" # forces replacement -> (known after apply) # forces replacement
!       security_group_rule_id = "sgr-0350132db55c09df4" -> (known after apply)
        tags                   = {
            "terraform-aws-modules" = "alb"
        }
        # (3 unchanged attributes hidden)
    }

  # aws_vpc_security_group_ingress_rule.this["all_http"] must be replaced
-/+ resource "aws_vpc_security_group_ingress_rule" "this" {
!       arn                    = "arn:aws:ec2:us-east-1:677160962006:security-group-rule/sgr-022994568024c06ca" -> (known after apply)
!       id                     = "sgr-022994568024c06ca" -> (known after apply)
!       security_group_id      = "sg-0a44fadcad8aa09fb" # forces replacement -> (known after apply) # forces replacement
!       security_group_rule_id = "sgr-022994568024c06ca" -> (known after apply)
        tags                   = {
            "terraform-aws-modules" = "alb"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_vpc_security_group_ingress_rule.this["all_https"] must be replaced
-/+ resource "aws_vpc_security_group_ingress_rule" "this" {
!       arn                    = "arn:aws:ec2:us-east-1:677160962006:security-group-rule/sgr-0742aaea832ca0612" -> (known after apply)
!       id                     = "sgr-0742aaea832ca0612" -> (known after apply)
!       security_group_id      = "sg-0a44fadcad8aa09fb" # forces replacement -> (known after apply) # forces replacement
!       security_group_rule_id = "sgr-0742aaea832ca0612" -> (known after apply)
        tags                   = {
            "terraform-aws-modules" = "alb"
        }
        # (6 unchanged attributes hidden)
    }

Plan: 5 to add, 0 to change, 4 to destroy.

Changes to Outputs:
+   arn                = (known after apply)
+   arn_suffix         = (known after apply)
+   dns_name           = (known after apply)
+   id                 = (known after apply)
!   security_group_arn = "arn:aws:ec2:us-east-1:677160962006:security-group/sg-0a44fadcad8aa09fb" -> (known after apply)
!   security_group_id  = "sg-0a44fadcad8aa09fb" -> (known after apply)
+   zone_id            = (known after apply)
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/mgmt/atlantis/alb`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fmgmt%252Fatlantis%252Falb%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/mgmt/atlantis/alb`
</details>
Plan: 5 to add, 0 to change, 4 to destroy.

---
### 6. dir: `infra/us-east-1/mgmt/atlantis/security-group` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/mgmt/atlantis/security-group`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fmgmt%252Fatlantis%252Fsecurity-group%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/mgmt/atlantis/security-group`

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`